tylertms/dspic33e-sim/conformance/nvm.c
    for (general_index = 0u; general_index < 16u; general_index++) {
        for (auxiliary_index = 0u; auxiliary_index < 16u; auxiliary_index++) {
            uint8_t general = codeguard_configuration_value(general_index);
            uint8_t auxiliary = codeguard_configuration_value(auxiliary_index);
            bool allowed = general == 0x03u && auxiliary == 0x03u;
            bool started;
            bool completed;

            dspic33_reset(cpu, 0u);
            load_codeguard_configuration(cpu, general, auxiliary);
            cpu->write_latches[0] = 0x31u;
            started = start_operation(cpu, 0u, CODEGUARD_AUXILIARY_CONFIGURATION);
            completed = finish_operation(cpu);
            expect(state,
                   started && completed &&
                       dspic33_read_configuration_byte(
                           cpu, CODEGUARD_AUXILIARY_CONFIGURATION) ==
                           (allowed ? 0x31u : auxiliary),
                   "CodeGuard FAS programming requires both unprotected segments");
        }
    }
}

static void codeguard_programming_cases(NvmConformance* state, Dspic33* cpu) {
    static const uint16_t operations[] = {1u, 2u, 3u};
    size_t operation_index;
    uint8_t target_segment;
    uint8_t origin_segment;
    uint8_t configuration_index;

    for (operation_index = 0u;
         operation_index < sizeof(operations) / sizeof(operations[0]);
         operation_index++) {
        uint16_t operation = operations[operation_index];
        for (target_segment = 0u; target_segment < 2u; target_segment++) {
            uint32_t target = target_segment == 0u
                                  ? 0x3000u
                                  : DSPIC33_AUXILIARY_PROGRAM_BASE + 0x1000u;
            for (origin_segment = 0u; origin_segment < 2u; origin_segment++) {
                uint32_t origin = origin_segment == 0u
                                      ? NVM_SEQUENCE_BASE
                                      : DSPIC33_AUXILIARY_PROGRAM_BASE + 0x3000u;
                for (configuration_index = 0u; configuration_index < 16u;
                     configuration_index++) {
                    uint8_t configuration =
                        codeguard_configuration_value(configuration_index);
                    bool write_protected = (configuration & 0x01u) == 0u;
                    bool high = codeguard_configuration_high(configuration);
                    bool allowed =
                        !write_protected && (!high || origin_segment == target_segment);
                    uint32_t initial = operation == 3u ? 0u : 0x00ffffffu;
                    uint32_t expected = operation == 3u ? allowed ? 0x00ffffffu : 0u
                                        : allowed       ? 0x00123456u
                                                        : 0x00ffffffu;
                    bool started;
                    bool completed;

                    dspic33_reset(cpu, 0u);
                    load_codeguard_configuration(
                        cpu, target_segment == 0u ? configuration : 0x03u,
                        target_segment == 0u ? 0x03u : configuration);
                    dspic33_load_program_word(cpu, target, initial);
                    cpu->write_latches[0] = 0x00123456u;
                    started = start_operation_from(cpu, operation, target, origin);
                    completed = finish_operation(cpu);
                    expect(state,
                           started && completed &&
                               cpu->nvm.auxiliary_origin == (origin_segment != 0u) &&
                               program_word(cpu, target) == expected,
                           "CodeGuard row and page programming matrix");
                }
            }
        }
    }

    for (operation_index = 0u;
         operation_index < sizeof(operations) / sizeof(operations[0]);
         operation_index++) {
        uint16_t operation = operations[operation_index];
        for (origin_segment = 0u; origin_segment < 2u; origin_segment++) {
            uint32_t origin = origin_segment == 0u
                                  ? NVM_SEQUENCE_BASE
                                  : DSPIC33_AUXILIARY_PROGRAM_BASE + 0x3000u;
            for (configuration_index = 0u; configuration_index < 16u;
                 configuration_index++) {
                uint8_t configuration =
                    codeguard_configuration_value(configuration_index);
                bool allowed = (configuration & 0x01u) != 0u &&
                               !codeguard_configuration_high(configuration);
                uint32_t target = operation == 3u ? 0u : 0x0100u;
                uint32_t initial = operation == 3u ? 0u : 0x00ffffffu;
                uint32_t expected = operation == 3u ? allowed ? 0x00ffffffu : 0u
                                    : allowed       ? 0x00123456u
                                                    : 0x00ffffffu;
                bool started;
                bool completed;

                dspic33_reset(cpu, 0u);
                load_codeguard_configuration(cpu, configuration, 0x03u);
                dspic33_load_program_word(cpu, target, initial);
                cpu->write_latches[0] = 0x00123456u;
                started = start_operation_from(cpu, operation, target, origin);
                completed = finish_operation(cpu);
                expect(state,
                       started && completed && program_word(cpu, target) == expected,
                       "CodeGuard IVT programming matrix");
            }
        }
    }
}

static void codeguard_segment_erase_cases(NvmConformance* state, Dspic33* cpu) {
    static const uint16_t operations[] = {0x0au, 0x0du};
    size_t operation_index;
    uint8_t origin_segment;

    for (operation_index = 0u;
         operation_index < sizeof(operations) / sizeof(operations[0]);
         operation_index++) {
        uint16_t operation = operations[operation_index];
        bool auxiliary_target = operation == 0x0au;
        uint32_t target = auxiliary_target ? DSPIC33_AUXILIARY_PROGRAM_BASE : 0x2000u;
        for (origin_segment = 0u; origin_segment < 2u; origin_segment++) {
            uint32_t origin = origin_segment == 0u
                                  ? NVM_SEQUENCE_BASE
                                  : DSPIC33_AUXILIARY_PROGRAM_BASE + 0x3000u;
            bool allowed = auxiliary_target != (origin_segment != 0u);
            bool started;
            bool completed;

            dspic33_reset(cpu, 0u);
            load_codeguard_configuration(cpu, 0x30u, 0x30u);
            dspic33_load_program_word(cpu, target, 0u);
            started = start_operation_from(cpu, operation, 0u, origin);
            completed = finish_operation(cpu);
            expect(state,
                   started && completed &&
                       program_word(cpu, target) == (allowed ? 0x00ffffffu : 0u) &&
                       dspic33_read_configuration_byte(
                           cpu, auxiliary_target ? CODEGUARD_AUXILIARY_CONFIGURATION
                                                 : CODEGUARD_GENERAL_CONFIGURATION) ==
                           (allowed ? 0xcfu : 0x30u),
                   "CodeGuard segment erase requires opposite-segment execution");
        }
    }
}

static void codeguard_origin_capture_cases(NvmConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    uint32_t target = DSPIC33_AUXILIARY_PROGRAM_BASE + 0x1000u;
    bool copy_initialized;

    dspic33_reset(cpu, 0u);
    load_codeguard_configuration(cpu, 0x03u, 0x31u);
    dspic33_load_program_word(cpu, target, 0x00ffffffu);
    cpu->write_latches[0] = 0x00123456u;
    expect(state, start_operation_from(cpu, 1u, target, NVM_SEQUENCE_BASE),
           "CodeGuard captures general NVM origin");
    cpu->pc = DSPIC33_AUXILIARY_PROGRAM_BASE + 0x3000u;
    expect(state,
           finish_operation(cpu) && !cpu->nvm.auxiliary_origin &&
               program_word(cpu, target) == 0x00ffffffu,
           "CodeGuard preserves rejected cross-segment origin until completion");

    dspic33_reset(cpu, 0u);
    load_codeguard_configuration(cpu, 0x03u, 0x31u);
    dspic33_load_program_word(cpu, target, 0x00ffffffu);
    cpu->write_latches[0] = 0x00123456u;
    expect(
        state,
        start_operation_from(cpu, 1u, target, DSPIC33_AUXILIARY_PROGRAM_BASE + 0x3000u),
        "CodeGuard captures auxiliary NVM origin");
    cpu->pc = NVM_SEQUENCE_BASE;
    expect(state,
           finish_operation(cpu) && cpu->nvm.auxiliary_origin &&
               program_word(cpu, target) == 0x00123456u,
           "CodeGuard preserves accepted self-segment origin until completion");

    dspic33_reset(cpu, 0u);
    load_codeguard_configuration(cpu, 0x03u, 0x31u);
    dspic33_load_program_word(cpu, target, 0x00ffffffu);
    cpu->write_latches[0] = 0x00654321u;
    expect(
        state,
        start_operation_from(cpu, 1u, target, DSPIC33_AUXILIARY_PROGRAM_BASE + 0x3000u),
        "CodeGuard auxiliary-origin copy operation starts");
    copy_initialized = dspic33_initialize(&copy);
    expect(state,
           copy_initialized && dspic33_copy(&copy, cpu) && copy.nvm.active &&
               copy.nvm.auxiliary_origin,
           "CodeGuard copy retains active auxiliary origin");
    if (copy_initialized) {
        cpu->pc = NVM_SEQUENCE_BASE;
        copy.pc = NVM_SEQUENCE_BASE;
        expect(state,
               finish_operation(cpu) && finish_operation(&copy) &&
                   program_word(cpu, target) == 0x00654321u &&
                   program_word(&copy, target) == 0x00654321u &&
                   cpu->nvm.auxiliary_origin && copy.nvm.auxiliary_origin,
               "CodeGuard copied auxiliary origins complete independently");
        dspic33_destroy(&copy);
    }
}

static void codeguard_persistent_read_cases(NvmConformance* state, Dspic33* cpu) {
    static const uint32_t targets[] = {
        PERSISTENT_PROGRAM_BASE, PERSISTENT_PROGRAM_TAG + PERSISTENT_PROGRAM_BASE};
    static const uint8_t configurations[] = {0x03u, 0x31u};
    size_t target_index;
    size_t configuration_index;
    uint8_t origin_segment;

    for (target_index = 0u; target_index < sizeof(targets) / sizeof(targets[0]);
         target_index++) {
        for (origin_segment = 0u; origin_segment < 2u; origin_segment++) {
            uint32_t origin = origin_segment == 0u
                                  ? 0x1000u
                                  : DSPIC33_AUXILIARY_PROGRAM_BASE + 0x3000u;
            for (configuration_index = 0u; configuration_index < sizeof(configurations);
                 configuration_index++) {
                uint8_t configuration = configurations[configuration_index];
                bool allowed = origin_segment == 0u || configuration == 0x03u;

                dspic33_reset(cpu, 0u);
                load_codeguard_configuration(cpu, configuration, 0x03u);
                dspic33_load_program_word(cpu, PERSISTENT_PROGRAM_BASE, 0x00ab1357u);
                expect(
                    state,
                    execute_codeguard_table_read(cpu, origin, targets[target_index]) ==
                            (allowed ? 0x1357u : 0u) &&
                        program_word(cpu, PERSISTENT_PROGRAM_BASE) == 0x00ab1357u &&
                        program_word(cpu, PERSISTENT_PROGRAM_TAG +
                                              PERSISTENT_PROGRAM_BASE) == 0x00ab1357u,
                    "CodeGuard physical and tagged persistent table reads");
            }
        }
    }
}

static void codeguard_read_cases(NvmConformance* state, Dspic33* cpu) {
    uint8_t target_segment;
    uint8_t origin_segment;
    uint8_t configuration_index;

